app/controllers/countries_controller.rb

  def show
    @country = Country.find(params[:id])
    @meals = Meal.where(country_id: @country.id)
---
SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "meals".* FROM "meals" WHERE "meals"."country_id" IS NULL