app/controllers/meals_controller.rb

SELECT "meals".* FROM "meals"
---
  def index
    @meals = Meal.all

INSERT INTO "meals" ("country_id", "created_at", "description", "name", "updated_at", "url", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @meal = @country.meals.build(meal_params)
    if @meal.save

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @meal = Meal.find(params[:id])

SELECT "countries".* FROM "countries" WHERE "countries"."id" = $1 LIMIT 1  [["id", "105"]]
---
  def find_country
    @country = Country.find(params[:country_id])